app/views/qualificacoes/_form.html.erb

<br/>
<%= f.collection_select(:cliente_id, Cliente.all, :id, :nome) %>
---
SELECT `clientes`.* FROM `clientes`  ORDER BY `clientes`.`nome` ASC

<br />
<%= f.collection_select(:restaurante_id, Restaurante.all, :id, :nome) %>
---
SELECT `restaurantes`.* FROM `restaurantes`  ORDER BY `restaurantes`.`nome` ASC