app/controllers/comentarios_controller.rb

SELECT `comentarios`.* FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

INSERT INTO `comentarios` (`conteudo`, `comentavel_id`, `comentavel_type`, `created_at`, `updated_at`) VALUES ('Boa comida, ambiente legal e temárico.', 3, 'Restaurante', '2015-12-14 19:37:55', '2015-12-14 19:37:55')
---
  def create
    @comentario = Comentario.new(comentario_params)
    if @comentario.save

UPDATE `comentarios` SET `conteudo` = 'Boa comida, ambiente legal e temático.', `updated_at` = '2015-12-15 03:00:05' WHERE `comentarios`.`id` = 1
---
  def update
    respond_to do |format|
      if @comentario.update(comentario_params)

SELECT  `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 2 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 2
---
 def destroy
   @comentario = Comentario.find(params[:id])
   @comentario.destroy

SELECT  `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
---
    def set_comentario
      @comentario = Comentario.find(params[:id])