app/controllers/restaurantes_controller.rb

def index
  @restaurantes = Restaurante.order("nome").page(params['page']).per(3)
---
SELECT `restaurantes`.* FROM `restaurantes`  ORDER BY `restaurantes`.`nome` ASC

def show
  @restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1

def create
  @restaurante = Restaurante.new(restaurante_params)
  if @restaurante.save
---
INSERT INTO `restaurantes` (`nome`, `endereco`, `especialidade`, `created_at`, `updated_at`) VALUES ('Temakeria Kumiai', 'Rua algo centro', 'Japonesa ', '2015-11-18 16:46:38', '2015-11-18 16:46:38')

def edit
  @restaurante = Restaurante.find(params[:id])
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 1 LIMIT 1

def update
  @restaurante = Restaurante.find params[:id]

  if @restaurante.update_attributes(restaurante_params)
---
SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 10 LIMIT 1
UPDATE `restaurantes` SET `endereco` = 'Rua Marçal Emiliano Sobrinho, 159', `updated_at` = '2015-12-12 20:45:16' WHERE `restaurantes`.`id` = 51